made UML_README use a mermaid based uml so it can render
